In [1]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
rows_list = ['danush', 'kumar', 'rahul']

In [5]:
rows_index = [11, 12, 13]

In [6]:
series_with_default_index = pd.Series(data=rows_list)

In [7]:
series_with_manual_index = pd.Series(data=rows_list, index=rows_index)

In [7]:
series_with_manual_index

11    danush
12     kumar
13     rahul
dtype: object

In [8]:
series_with_default_index

0    danush
1     kumar
2     rahul
dtype: object

In [8]:
type(series_with_default_index)

pandas.core.series.Series

In [9]:
series_with_default_index[0]

'danush'

In [10]:
df = pd.DataFrame(np.random.randn(5, 4), [1, 2, 3, 4, 5], 'PHY CHE MAT ENG'.split())

In [11]:
df[df > 0]

        PHY  CHE       MAT       ENG
1       NaN  NaN  1.268054  0.198313
2  0.065100  NaN  1.040549       NaN
3  0.089566  NaN       NaN  0.298134
4  1.393077  NaN  1.138660       NaN
5       NaN  NaN  0.357651  3.146842

In [12]:
type(df['PHY'])

pandas.core.series.Series

In [13]:
df['PHY CHE'.split()]

        PHY       CHE
1 -0.321554 -0.402920
2  0.065100 -0.674130
3  0.089566 -0.907830
4  1.393077 -0.661005
5 -0.872078 -1.145939

In [15]:
df['TOTAL'] = df['PHY'] + df['CHE'] + df['ENG'] + df['MAT']

In [16]:
df.drop('TOTAL', axis=1, inplace=True)

In [17]:
df

        PHY       CHE       MAT       ENG
1  0.286645 -0.719246  1.172316 -0.902858
2  0.763158  2.045395  1.266706 -0.807446
3 -0.517896 -1.001309  0.046573 -0.735983
4  0.127658 -0.184359 -0.898020  0.320701
5  2.250388 -0.469895 -0.582020  1.309097

In [18]:
df.loc[1, 'PHY']

0.28664522650888774

In [19]:
df.loc[[1, 2], ['PHY', 'CHE']]

        PHY       CHE
1  0.286645 -0.719246
2  0.763158  2.045395

In [20]:
df.iloc[1]

PHY    0.763158
CHE    2.045395
MAT    1.266706
ENG   -0.807446
Name: 2, dtype: float64

In [21]:
df.iloc[1:2, 0:]

        PHY       CHE       MAT       ENG
2  0.763158  2.045395  1.266706 -0.807446

In [22]:
df > 0

     PHY    CHE    MAT    ENG
1   True  False   True  False
2   True   True   True  False
3  False  False   True  False
4   True  False  False   True
5   True  False  False   True

In [23]:
df[df > 0]

        PHY       CHE       MAT       ENG
1  0.286645       NaN  1.172316       NaN
2  0.763158  2.045395  1.266706       NaN
3       NaN       NaN  0.046573       NaN
4  0.127658       NaN       NaN  0.320701
5  2.250388       NaN       NaN  1.309097

In [24]:
df['PHY'] > 0

1     True
2     True
3    False
4     True
5     True
Name: PHY, dtype: bool

In [25]:
type(df['PHY'] > 0)

pandas.core.series.Series

In [26]:
df[df['PHY'] > 0]

        PHY       CHE       MAT       ENG
1  0.286645 -0.719246  1.172316 -0.902858
2  0.763158  2.045395  1.266706 -0.807446
4  0.127658 -0.184359 -0.898020  0.320701
5  2.250388 -0.469895 -0.582020  1.309097

In [27]:
df[df['PHY'] > 0][['PHY', 'CHE']]

        PHY       CHE
1  0.286645 -0.719246
2  0.763158  2.045395
4  0.127658 -0.184359
5  2.250388 -0.469895

In [28]:
df[(df['PHY'] > 0) & (df['MAT'] > 0)][['PHY', 'MAT']]

        PHY       MAT
1  0.286645  1.172316
2  0.763158  1.266706

In [29]:
outer_index = ['A', 'A', 'A', 'B', 'B', 'B']
inner_index = [1, 2, 3, 1, 2, 3]
multi_index = list(zip(outer_index, inner_index))
idx = pd.MultiIndex.from_tuples(multi_index)

In [30]:
df2 = pd.DataFrame(np.random.randn(6, 4), index=idx)

In [31]:
df2.index.names = ['outer', "inner"]

In [32]:
df2

                    0         1         2         3
outer inner
A     1     -0.089315 -0.868875 -0.000875 -0.622135
      2      1.312913  1.362939  0.725136  1.245548
      3      1.706873  0.246737  0.025267 -0.577290
B     1     -0.730619 -1.115421  0.585851 -0.333056
      2      0.895907  0.737625 -0.664806 -1.105349
      3     -0.253066 -1.221727 -1.474419 -0.522367

In [33]:
df2.loc['A']

              0         1         2         3
inner
1     -0.089315 -0.868875 -0.000875 -0.622135
2      1.312913  1.362939  0.725136  1.245548
3      1.706873  0.246737  0.025267 -0.577290

In [34]:
df2.loc['A'].loc[[1,2], [0, 1]]

              0         1
inner
1     -0.089315 -0.868875
2      1.312913  1.362939

In [35]:
df2.xs(1, level='inner')

              0         1         2         3
outer
A     -0.089315 -0.868875 -0.000875 -0.622135
B     -0.730619 -1.115421  0.585851 -0.333056

In [36]:
def apply_null(x):
    if x < 0:
        return None
    return x

In [37]:
df2 = df2.apply(np.sqrt)

In [38]:
df2

                    0         1         2         3
outer inner
A     1           NaN       NaN       NaN       NaN
      2      1.145824  1.167450  0.851549  1.116041
      3      1.306473  0.496727  0.158957       NaN
B     1           NaN       NaN  0.765409       NaN
      2      0.946524  0.858851       NaN       NaN
      3           NaN       NaN       NaN       NaN

In [39]:
from sklearn.impute import SimpleImputer

Imputer = SimpleImputer(missing_values=np.nan, strategy="mean")
imputed_df = pd.DataFrame(Imputer.fit_transform(df2))
imputed_df

          0         1         2         3
0  1.132940  0.841009  0.591972  1.116041
1  1.145824  1.167450  0.851549  1.116041
2  1.306473  0.496727  0.158957  1.116041
3  1.132940  0.841009  0.765409  1.116041
4  0.946524  0.858851  0.591972  1.116041
5  1.132940  0.841009  0.591972  1.116041

In [40]:
imp = pd.DataFrame(Imputer.transform(df.apply(np.sqrt)))
imp.columns = df.columns
imp

        PHY       CHE       MAT       ENG
0  0.535393  0.841009  1.082735  1.116041
1  0.873589  1.430173  1.125480  1.116041
2  1.132940  0.841009  0.215808  1.116041
3  0.357293  0.841009  0.591972  0.566305
4  1.500129  0.841009  0.591972  1.144158

In [41]:
df2.select_dtypes(exclude='object')

                    0         1         2         3
outer inner
A     1           NaN       NaN       NaN       NaN
      2      1.145824  1.167450  0.851549  1.116041
      3      1.306473  0.496727  0.158957       NaN
B     1           NaN       NaN  0.765409       NaN
      2      0.946524  0.858851       NaN       NaN
      3           NaN       NaN       NaN       NaN

In [42]:
df2.dropna(axis=1, subset=[3])

KeyError: [3]

In [43]:
df2[0].fillna(value=df2[0].mean())

outer  inner
A      1        1.132940
       2        1.145824
       3        1.306473
B      1        1.132940
       2        0.946524
       3        1.132940
Name: 0, dtype: float64

In [44]:
df2

                    0         1         2         3
outer inner
A     1           NaN       NaN       NaN       NaN
      2      1.145824  1.167450  0.851549  1.116041
      3      1.306473  0.496727  0.158957       NaN
B     1           NaN       NaN  0.765409       NaN
      2      0.946524  0.858851       NaN       NaN
      3           NaN       NaN       NaN       NaN

In [60]:
df2['COUNTRY'] = ['GERMANY', 'GERMANY', 'INDIA', 'CANADA', 'INDIA', 'GERMANY' ]

In [61]:
grpby_country = df2.groupby(by='COUNTRY')

In [62]:
grpby_country.mean()

                0         1         2         3
COUNTRY
CANADA        NaN       NaN  0.765409       NaN
GERMANY  1.145824  1.167450  0.851549  1.116041
INDIA    1.126498  0.677789  0.158957       NaN

In [48]:
grpby_country.describe()

            0                                                              \
        count      mean       std       min       25%       50%       75%
COUNTRY
CANADA    0.0       NaN       NaN       NaN       NaN       NaN       NaN
GERMANY   1.0  1.145824       NaN  1.145824  1.145824  1.145824  1.145824
INDIA     2.0  1.126498  0.254523  0.946524  1.036511  1.126498  1.216486

                      1            ...         2               3            \
              max count      mean  ...       75%       max count      mean
COUNTRY                            ...
CANADA        NaN   0.0       NaN  ...  0.765409  0.765409   0.0       NaN
GERMANY  1.145824   1.0  1.167450  ...  0.851549  0.851549   1.0  1.116041
INDIA    1.306473   2.0  0.677789  ...  0.158957  0.158957   0.0       NaN


        std       min       25%       50%       75%       max
COUNTRY
CANADA  NaN       NaN       NaN       NaN       NaN       NaN
GERMANY NaN  1.116041  1.116041  1.116041  1.116041  1.116041
INDIA   NaN       NaN       NaN       NaN       NaN       NaN

[3 rows x 32 columns]

In [86]:
for n, c in df2.items():
    print(n)

0
1
2
3
COUNTRY

In [63]:
numerical_cols = [cols for cols in df2.columns if df2[cols].dtype != 'object']
numerical_cols

[0, 1, 2, 3]

In [64]:
categorical_cols = [cols for cols in df2.columns if df2[cols].dtype == 'object']
categorical_cols

['COUNTRY']

In [81]:
a = df2["COUNTRY"].astype('category').cat.as_ordered()
a

outer  inner
A      1        GERMANY
       2        GERMANY
       3          INDIA
B      1         CANADA
       2          INDIA
       3        GERMANY
Name: COUNTRY, dtype: category
Categories (3, object): [CANADA, GERMANY, INDIA]

In [83]:
type(df2['COUNTRY'].values)

pandas.core.arrays.categorical.Categorical

In [73]:
for n,c in df2.items():
    print(c)
    break;

outer  inner
A      1             NaN
       2        1.145824
       3        1.306473
B      1             NaN
       2        0.946524
       3             NaN
Name: 0, dtype: float64

In [74]:
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder

# Preprocessing for numerical data
numerical_transformer = SimpleImputer(strategy='constant')

# Preprocessing for categorical data
categorical_transformer = Pipeline(steps=[
    ('imputer', SimpleImputer(strategy='most_frequent')),
    ('onehot', OneHotEncoder(handle_unknown='ignore'))
])

# Bundle preprocessing for numerical and categorical data
preprocessor = ColumnTransformer(
    transformers=[
        ('num', numerical_transformer, numerical_cols),
        ('cat', categorical_transformer, categorical_cols)
    ])


my_pipeline = Pipeline(steps=[('preprocessor', preprocessor),
                              ('model', model)
                             ])

NameError: name 'model' is not defined

In [93]:
import pandas as pd


data = pd.DataFrame({'A':[3, np.nan, 3, 4, 0]})
data['A'].mean()

2.5